DunningLetters/DunningLetters/Files/NS_FU/Fusion/Customer/UpdateCustomerProfile/Request/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://xmlns.oracle.com/apps/financials/receivables/customers/customerProfileService/types/" xmlns:cus="http://xmlns.oracle.com/apps/financials/receivables/customers/customerProfileService/" xmlns:cus1="http://xmlns.oracle.com/apps/financials/receivables/customerSetup/customerProfiles/model/flex/CustomerProfileDff/" xmlns:cus2="http://xmlns.oracle.com/apps/financials/receivables/customerSetup/customerProfiles/model/flex/CustomerProfileGdf/">
	<soapenv:Header/>
	<soapenv:Body>
		<typ:updateCustomerProfile>
			<typ:customerProfile>
				<cus:AccountNumber>Testing_Account</cus:AccountNumber>
				<cus:SiteNumber>Test1002</cus:SiteNumber>
				<cus:CustomerAccountId>300000003167502</cus:CustomerAccountId>
				<cus:ProfileClassName>DEFAULT</cus:ProfileClassName>
				<cus:ClearingDays>10</cus:ClearingDays>
				<cus:EffectiveStartDate>2021-02-10</cus:EffectiveStartDate>
				<cus:PartyId>300000003167493</cus:PartyId>
				<cus:Tolerance>50%</cus:Tolerance>
				<cus:PaymentTerms>IMMEDIATE</cus:PaymentTerms>
				<cus:PreferredContactMethod>E-Mail</cus:PreferredContactMethod>
				<cus:PreferredDeliveryMethod>E-Mail</cus:PreferredDeliveryMethod>
				<cus:CreditReviewCycleName>Annually</cus:CreditReviewCycleName>
				<cus:CreditCurrencyCode>INR</cus:CreditCurrencyCode>
				<cus:StatementDeliveryMethod>E-Mail</cus:StatementDeliveryMethod>
			</typ:customerProfile>
		</typ:updateCustomerProfile>
	</soapenv:Body>
</soapenv:Envelope>